{"keras_version": "1.0.5", "loss": "categorical_crossentropy", "class_name": "Sequential", "sample_weight_mode": null, "config": [{"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "bias": true, "b_regularizer": null, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "batch_input_shape": [null, 784], "input_dtype": "float32", "output_dim": 512, "W_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "bias": true, "b_regularizer": null, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "output_dim": 512, "W_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "bias": true, "b_regularizer": null, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "output_dim": 10, "W_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "softmax"}}], "optimizer": {"rho": 0.8999999761581421, "name": "RMSprop", "epsilon": 1e-08, "lr": 0.0010000000474974513}}