{"class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Dense", "config": {"input_dtype": "float32", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_1", "input_dim": null, "bias": true, "init": "glorot_uniform", "output_dim": 512, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "batch_input_shape": [null, 784]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "name": "dense_2", "input_dim": null, "bias": true, "init": "glorot_uniform", "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "name": "dense_3", "input_dim": null, "bias": true, "init": "glorot_uniform", "output_dim": 10, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "softmax"}}]}